[
    {
        "headline": "RCCIIT: A Leading Engineering Institute in Kolkata",
        "subheadings": ["Introduction", "About RCCIIT", "Academics", "Career Prospects"],
        "content": "<p>RCCIIT, a government-sponsored engineering institute, is located in Kolkata, West Bengal, India. Established in 1999, the institute has grown to become a leading name in the field of technology education.</p>
                    <p>About RCCIIT, the institute is approved by AICTE, New Delhi, and is affiliated to MAKAUT, W.B. It is a unit of RCC Institute of Technology, an autonomous society of the Department of Higher Education, Govt. of West Bengal.</p>
                    <p>The institute offers a range of undergraduate and postgraduate programs in fields such as computer science, information technology, electronics, and communication engineering. The institute is known for its strong academic curriculum, state-of-the-art infrastructure, and experienced faculty.</p>
                    <p>Students of RCCIIT have excellent career prospects, with many leading companies visiting the campus for recruitment. The institute also provides training and placement assistance to its students, enabling them to secure top-notch jobs.</p>"
    },
    {
        "headline": "RCCIIT: A Hub for Technical Education",
        "subheadings": ["Introduction", "Infrastructure", "Faculty", "Placements"],
        "content": "<p>RCCIIT is a Tier 2 engineering college, known for its strong academic reputation and excellent infrastructure. The institute has a sprawling campus, equipped with modern facilities, including state-of-the-art laboratories, computer centers, and a well-stocked library.</p>
                    <p>The institute has a team of experienced and dedicated faculty members, who are committed to imparting quality education to their students. The faculty members are actively involved in research and development, and have published several papers in reputed journals.</p>
                    <p>RCCIIT has an impressive placement record, with many leading companies visiting the campus for recruitment. The institute has a dedicated training and placement cell, which provides assistance to its students in securing top-notch jobs.</p>
                    <p>With its strong academic curriculum, excellent infrastructure, and experienced faculty, RCCIIT is an ideal destination for students seeking a career in technology.</p>"
    },
    {
        "headline": "RCCIIT: Empowering Students for a Bright Future",
        "subheadings": ["Introduction", "Student Life", "Alumni", "Conclusion"],
        "content": "<p>RCCIIT is more than just an engineering institute - it's a community that empowers its students to achieve their full potential. The institute offers a range of extracurricular activities, including cultural events, sports, and club activities, which help students develop their skills and personalities.</p>
                    <p>The institute has a strong alumni network, with many of its alumni holding top positions in leading companies. The alumni association is actively involved in providing guidance and support to current students, and in organizing events and activities that benefit the institute.</p>
                    <p>In conclusion, RCCIIT is a leading engineering institute that offers its students a unique blend of academic excellence, extracurricular activities, and career opportunities. With its strong reputation, excellent infrastructure, and dedicated faculty, the institute is an ideal destination for students seeking a career in technology.</p>"
    }
]