[
    {
        "source": "Times of India",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "Placements slowing down but colleges can adapt to new normal",
        "summary": "In 2024, media reports suggest a reduction in placements in our higher educational institutions anywhere between 30-70%. In addition to fewer ..."
    },
    {
        "source": "Mentor Me Careers",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "Placement Scenario in India: Navigating Opportunities in the ...",
        "summary": "The placement scenario in India is undergoing a rapid transformation, driven by technological advancements, entrepreneurial spirit, and evolving ..."
    },
    {
        "source": "Group Discussion Ideas",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "Placement scenario in India",
        "summary": "India, being a country with the youngest population needs to harness its potential effectively to ensure the development of the nation."
    },
    {
        "source": "InsideIIM",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "What Is The Placement Scenario At Indian B-schools In 2023?",
        "summary": "Despite the tough job market for Indian B-school students in 2023, remember this: determination often leads to success."
    },
    {
        "source": "Reddit",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "What is the placement scenario in your college (mention tier)?",
        "summary": "So a tier 2 would be a college where placements are not only limited to just witch but also not at faang level. Tier 3 is where witch is all ..."
    },
    {
        "source": "Economic Times",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "Private engineering colleges see 50-70% drop in placements",
        "summary": "India's private engineering institutes are reporting a 50-70% drop in placements this year as macroeconomic challenges force companies, ..."
    },
    {
        "source": "LinkedIn",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "Placement scenario",
        "summary": "In recent years, the placement scenario in India has witnessed a remarkable transformation. With a rapidly growing economy and a burgeoning ..."
    },
    {
        "source": "Quora",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "What are the emerging trends in campus placements for 2024?",
        "summary": "In 2024, campus placements are seeing some key trends shaping job opportunities…. firstly remote work is becoming more common, allowing students ..."
    },
    {
        "source": "Studypool",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "SOLUTION: Gd topic placement scenario in india",
        "summary": "Placement scenario in India :Unemployment is on the rise in the country. Jobs are on the decline. Placements scenario in."
    },
    {
        "source": "Financial Express",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "Only 7% of Indian colleges achieve full campus placement: Unstop ...",
        "summary": "A mere 7% of Indian institutions were able to attain full placement rates, as per findings published by hiring platform Unstop in its Talent ..."
    },
    {
        "source": "Aryan Trivedi on Twitter",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "This is the placement scenario of a tier 1 college in India!!",
        "summary": "Really sad for the students who are appearing for placements this year :/"
    },
    {
        "source": "Indian Tech & Infra on Twitter",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "India's private engineering institutes are reporting a 50-70% drop in placements this year.",
        "summary": "India's private engineering institutes are reporting a 50-70% drop in placements this year."
    },
    {
        "source": "Training and Placement Cell, NIT Delhi on Twitter",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "The official Twitter account of the Training and Placement Cell of National Institute of Technology, Delhi",
        "summary": "The official Twitter account of the Training and Placement Cell of National Institute of Technology, Delhi - An Institute of National Importance."
    },
    {
        "source": "JAYAPRAKASH GANDHI on Twitter",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "38% of students from IITs went unplaced without jobs after their degree",
        "summary": "38% of students from IITs went unplaced without jobs after their degree IITs are India's top technical colleges taking best 20,000 students of India."
    },
    {
        "source": "Shital Rawandale on Twitter",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "India could have more billionaires, Olympic gold, scientists if kids ...",
        "summary": "Want to know How is the Placement Scenario across the Country this year ?? Image."
    },
    {
        "source": "Indian Express",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "IIT Placements: Why giants like Amazon, Meta,Google and Twitter ...",
        "summary": "Amid global layoffs, the Indian Institutes of Technology (IITs) have seen a decline in the offers coming from America-based tech giants such as ..."
    },
    {
        "source": "Quora",
        "timestamp": "2024-06-29T12:34:56Z",
        "headline": "Are companies like Google, Facebook, Twitter, etc. open for students ...",
        "summary": "No! Companies like Google, Facebook, Twitter etc. are NOT open for students from all departments during placements at the IITs."
    }
]